nc: 10
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2fBRA, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2fBRA, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2fBRA, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2fBRA, [512]]
  - [[1, 4, 12], 1, ASFF3, [0]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, C2fBRA, [256, True]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, C2fBRA, [512, True]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, Conv, [512, 3, 1]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, C2fBRA, [1024, True]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, Conv, [1024, 3, 1]]
  - [[17, 21, 25], 1, Detect, [nc]]
