# PRNet-YOLOv8s for VisDrone.
# The backbone uses ESSamp for detail-preserving downsampling, while the neck
# progressively refines P5 -> P2 and then propagates refined features upward.

nc: 10
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ESSamp, [64]]           # 0  P1/2
  - [-1, 1, ESSamp, [128]]          # 1  P2/4
  - [-1, 3, C2f, [128, true]]       # 2  P2 detail feature
  - [-1, 1, ESSamp, [256]]          # 3  P3/8
  - [-1, 6, C2f, [256, true]]       # 4  P3 feature
  - [-1, 1, Conv, [512, 3, 2]]      # 5  P4/16
  - [-1, 6, C2f, [512, true]]       # 6  P4 feature
  - [-1, 1, Conv, [1024, 3, 2]]     # 7  P5/32
  - [-1, 3, C2f, [1024, true]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9  P5 semantic feature

head:
  # First refinement round: P5 -> P4 -> P3 -> P2.
  - [-1, 1, nn.Upsample, [null, 2, nearest]]  # 10 P5 -> P4
  - [[-1, 6], 1, Concat, [1]]                # 11
  - [-1, 3, C2f, [512]]                      # 12 refined P4

  - [-1, 1, nn.Upsample, [null, 2, nearest]]  # 13 P4 -> P3
  - [[-1, 4], 1, Concat, [1]]                # 14
  - [-1, 3, C2f, [256]]                      # 15 refined P3

  - [-1, 1, nn.Upsample, [null, 2, nearest]]  # 16 P3 -> P2
  - [[-1, 2], 1, Concat, [1]]                # 17
  - [-1, 3, C2f, [128]]                      # 18 first P2 feature

  # Second refinement round: reuse the first P2 feature and backbone P3/P2.
  - [-1, 1, Conv, [256, 3, 2]]               # 19 P2 -> P3
  - [-1, 3, C2f, [512, true]]                # 20
  - [[-1, 4], 1, Concat, [1]]                # 21
  - [-1, 3, C2f, [256]]                      # 22 second P3 feature
  - [-1, 1, nn.Upsample, [null, 2, nearest]]  # 23 P3 -> P2
  - [[2, 18], 1, Concat, [1]]                # 24 reuse backbone and first P2
  - [[-1, 23], 1, Concat, [1]]               # 25 fuse second-round P3
  - [-1, 3, C2f, [256]]                      # 26 second P2 feature

  # Third refinement round and final P2/P3/P4 outputs.
  - [-1, 1, Conv, [128, 3, 2]]               # 27 P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]]               # 28 P3 -> P4
  - [-1, 3, C2f, [512]]                      # 29 P4 prediction feature
  - [-1, 1, nn.Upsample, [null, 2, nearest]]  # 30 P4 -> P3
  - [[-1, 4], 1, Concat, [1]]                # 31
  - [-1, 3, C2f, [256]]                      # 32 P3 prediction feature
  - [-1, 1, nn.Upsample, [null, 2, nearest]]  # 33 P3 -> P2
  - [[2, 26], 1, Concat, [1]]                # 34 reuse backbone and second P2
  - [[-1, 33], 1, Concat, [1]]               # 35 fuse final P3
  - [-1, 3, C2f, [128]]                      # 36 P2 prediction feature

  - [[36, 32, 29], 1, Detect, [nc]]          # Detect(P2, P3, P4)
