# PRNet-YOLOv8s for VisDrone
nc: 10
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, ESSamp, [64]]
  - [-1, 1, ESSamp, [128]]
  - [-1, 3, C2f, [128, true]]
  - [-1, 1, ESSamp, [256]]
  - [-1, 6, C2f, [256, true]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, true]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, true]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 3, C2f, [512, true]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[2, 18], 1, Concat, [1]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[2, 26], 1, Concat, [1]]
  - [[-1, 33], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]
  - [[36, 32, 29], 1, Detect, [nc]]
