nc: 10
scale: s
scales:
  s: [0.33, 0.50, 1024]
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, true]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, true]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, true]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, true]]
  - [-1, 1, SPPF, [1024, 5]]
head:
  - [[0, 2, 4], 1, CSFM, []]
  - [[2, 4, 6], 1, CSFM, []]
  - [[4, 6, 9], 1, CSFM, []]
  - [9, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]
  - [[21, 24, 27, 30], 1, Detect, [nc]]
